In [2]:
distance=[56,89,45,75,68]
time=[0.3,2.1,1.3,1.9,3.2]

In [3]:
speed=distance/time

TypeError: unsupported operand type(s) for /: 'list' and 'list'

In [4]:
distance*3

[56, 89, 45, 75, 68, 56, 89, 45, 75, 68, 56, 89, 45, 75, 68]

In [5]:
distance+time

[56, 89, 45, 75, 68, 0.3, 2.1, 1.3, 1.9, 3.2]

In [9]:
import numpy as np

In [10]:
dist_array=np.array(distance)
time_array=np.array(time)

In [11]:
speed=dist_array/time_array
speed

array([186.66666667,  42.38095238,  34.61538462,  39.47368421,
        21.25      ])

In [12]:
### arrays are data structures which can be created using the numpy package. It supports mixed data types.

In [13]:
print(type(dist_array))

<class 'numpy.ndarray'>

##### We combine 0D arrays to get a 1D array,we combine 1D arrays to get a 2D array. And we combine 2D arrays to get a 3D array.

In [14]:
###0D arrays-
array_0D=np.array(90)
print(type(array_0D))
print(array_0D.ndim)

<class 'numpy.ndarray'>
0

In [17]:
###1D array:
array_1d=np.array([7,9,2,13.5],dtype='float')
print(type(array_1d))
print(array_1d.ndim)
print(array_1d)
print(array_1d.dtype)

<class 'numpy.ndarray'>
1
[ 7.   9.   2.  13.5]
float64

In [19]:
####2D array-:
array_2D=np.array([[3,5,6,7,8],[9,10,11,12,13],[0,5,1,3,8]])
print(array_2D)
print(array_2D.ndim)
print(array_2D.dtype)
print(array_2D.shape)
print(array_2D.size)

[[ 3  5  6  7  8]
 [ 9 10 11 12 13]
 [ 0  5  1  3  8]]
2
int32
(3, 5)
15

In [20]:
array_3d=np.array([[[3,4,5],[6,7,8]],[[9,10,11],[12,13,14]]])
print(array_3d)
print(array_3d.ndim)
print(array_3d.dtype)
print(array_3d.shape)
print(array_3d.size)

[[[ 3  4  5]
  [ 6  7  8]]

 [[ 9 10 11]
  [12 13 14]]]
3
int32
(2, 2, 3)
12

#### Conversion of a lower dimensional array to a higher dimensional array,by adding dimensions.

In [23]:
arr1d=np.array([2,3,4,5,6,7,8,9,10,11,12,13])
print(arr1d)
print(arr1d.ndim)
print(arr1d.size)
print(arr1d.dtype)
print(arr1d.shape)

[ 2  3  4  5  6  7  8  9 10 11 12 13]
1
12
int32
(12,)

In [22]:
arr2d=arr1d.reshape(6,2)
print(arr2d)
print(arr2d.ndim)
print(arr2d.size)
print(arr2d.dtype)

[[ 2  3]
 [ 4  5]
 [ 6  7]
 [ 8  9]
 [10 11]
 [12 13]]
2
12
int32

In [24]:
arr1d

array([ 2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13])

In [25]:
##convert to a 3D array:
arr3d=arr1d.reshape(3,2,2)
print(arr3d)
print(arr3d.ndim)
print(arr3d.size)
print(arr3d.dtype)

[[[ 2  3]
  [ 4  5]]

 [[ 6  7]
  [ 8  9]]

 [[10 11]
  [12 13]]]
3
12
int32

In [26]:
###Q) create a 1D array with first 9 natural numbers. Then add a dimension to convert the same to a 2D array.

In [37]:
arr6=np.arange(1,10)
print(arr6)
reshaped_arr6=np.reshape(arr6,(3,3))
print(reshaped_arr6)

[1 2 3 4 5 6 7 8 9]
[[1 2 3]
 [4 5 6]
 [7 8 9]]

In [28]:
####Q) create a 2D array with 6 rows and 3 columns . reshape it to a 3D array

### we have a module called 'random' which provides functions for generating random numbers from a standard normal dist,a standard normal dist have 0 mean and std=1

In [41]:
arr7=np.random.rand(6,3)
print(arr7)      #all the random numbers we got will lie between 0 and 1

print('------------------------------')
reshaped_arr7=arr7.reshape(2,3,3)
print(reshaped_arr7)

[[0.13248196 0.78922048 0.90939262]
 [0.15527765 0.62357934 0.32651432]
 [0.64253794 0.41180134 0.81394446]
 [0.1013889  0.24728158 0.94971384]
 [0.47151377 0.97334275 0.62191843]
 [0.61436758 0.91196283 0.23616351]]
------------------------------
[[[0.13248196 0.78922048 0.90939262]
  [0.15527765 0.62357934 0.32651432]
  [0.64253794 0.41180134 0.81394446]]

 [[0.1013889  0.24728158 0.94971384]
  [0.47151377 0.97334275 0.62191843]
  [0.61436758 0.91196283 0.23616351]]]

#### Convert a higher dimentional array to a lower dimentional array- we use two functions ravel() and flatten().

In [29]:
arr_lowerd=arr3d.flatten()
arr_lowerd

array([ 2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13])

In [30]:
arr_lowerdd=arr2d.ravel()
arr_lowerdd

array([ 2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13])

In [31]:
#create two arrays one having elements 30,20,10 and the second having elements 40,50,60 and perform the basic mathematical
#operations.

In [34]:
a = np.array([30,20,10])
b = np.array([40,50,60])
sum = a+b
mult = a*b
div = b/a
sub = b-a
print(f"sum = {sum}\nmultiplication = {mult}\ndivision = {div}\nsubtraction = {sub}")

sum = [70 70 70]
multiplication = [1200 1000  600]
division = [1.33333333 2.5        6.        ]
subtraction = [10 30 50]

In [32]:
###statistical operations-:
array4=np.array([[4,3,2],[10,1,0],[5,8,24]])
array4

array([[ 4,  3,  2],
       [10,  1,  0],
       [ 5,  8, 24]])

In [33]:
####perform basic statistical operations like mean,median,std,var.

In [35]:
mean = np.mean(array4)
median = np.median(array4)
std = np.std(array4)
var = np.var(array4)
print(f"array = {array4}\nmean = {mean}\nmedian = {median}\nstandard deviation = {std}\nvariance = {var}")

array = [[ 4  3  2]
 [10  1  0]
 [ 5  8 24]]
mean = 6.333333333333333
median = 4.0
standard deviation = 6.944222218666553
variance = 48.22222222222222

##### Indexing

In [2]:
import numpy as np

In [3]:
arr_1d=np.array([1,2,3,4,5])

In [4]:
arr_2d=np.array([[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15]])
arr_2d

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15]])

In [5]:
arr_3d=np.array([[[1,2,3],[4,5,6]],[[7,8,9],[10,11,12]],[[13,14,15],[16,17,18]]])
arr_3d

array([[[ 1,  2,  3],
        [ 4,  5,  6]],

       [[ 7,  8,  9],
        [10, 11, 12]],

       [[13, 14, 15],
        [16, 17, 18]]])

In [6]:
###print 4 from the 1D array:
print(arr_1d[3])
print(arr_1d[-2])

4
4

In [7]:
### find out the sum of the 4th and 2nd element of the 1d array:
sum1=arr_1d[3]+arr_1d[1]
sum1

6

In [8]:
arr_2d

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15]])

In [9]:
### how do i slice 3(3rd element of the first row)
arr_2d[0,2]

3

In [10]:
### how do i slice 14 from arr_2d?
arr_2d[2,3]

14

In [11]:
arr_2d[-1,-2]

14

In [12]:
arr_3d

array([[[ 1,  2,  3],
        [ 4,  5,  6]],

       [[ 7,  8,  9],
        [10, 11, 12]],

       [[13, 14, 15],
        [16, 17, 18]]])

In [13]:
###slice out 16 from arr_3d
arr_3d[2,1,0]

16

In [14]:
###Q)slice out 7,10,9,12 from the 3D array

In [15]:
seven=arr_3d[1,0,0]
ten=arr_3d[1,1,0]
nine=arr_3d[1,0,2]
twelve=arr_3d[1,1,2]

print(seven,ten,nine,twelve)

7 10 9 12

In [15]:
###Q) slice out the second row (10,11,12) from arr_3d

In [16]:
res=arr_3d[1,1:]
res

array([[10, 11, 12]])

In [17]:
arr_3d[1,1,:]

array([10, 11, 12])

In [19]:
arr_3d[1,0:]

array([[ 7,  8,  9],
       [10, 11, 12]])

In [18]:
arr_3d[1,1]

array([10, 11, 12])

#### Slicing creates a view of the original array. indexing on the other hand creates a copy of the original array.

In [20]:
x=np.array([4,5,6])

In [21]:
y=x.copy()

In [22]:
x[1]=10

In [23]:
x

array([ 4, 10,  6])

In [24]:
y

array([4, 5, 6])

In [25]:
###copy is independent of the original array.

In [26]:
z=x.view()

In [27]:
x[-1]=60

In [28]:
x

array([ 4, 10, 60])

In [29]:
z

array([ 4, 10, 60])

In [30]:
y

array([4, 5, 6])

In [31]:
### view is dependent on the original array. if we make any changes in the original array,the view gets impacted.

In [32]:
employee_rating=np.array([1,4,3,5,6,8,9,10,12])

In [33]:
###I want 4-9 elements to be sliced out from employee rating.
employee_rating[1:7]

array([4, 3, 5, 6, 8, 9])

In [ ]:
###step method:
#syntax=[start:stop:step]

In [34]:
employee_rating[1:6:3]

array([4, 6])

In [35]:
employee_rating[1:6:2]

array([4, 5, 8])

In [36]:
employee_rating[2:8:1]

array([ 3,  5,  6,  8,  9, 10])

In [37]:
#### we use the step method when we want to skip elements while reading within a specific range. we will
#### always skip=step-1 elements.

In [38]:
### Q) i want only 1 and 6 sliced out from employee rating.
employee_rating

array([ 1,  4,  3,  5,  6,  8,  9, 10, 12])

In [39]:
employee_rating[0:5:4]

array([1, 6])

In [40]:
employee_rating[:8:4]

array([1, 6])

In [42]:
a1=np.arange(21)
a1

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20])

In [43]:
###Q)slice out 14 and 16 from the array a1

In [45]:
####Q) slice out 11,14,17 using the step method from a1

In [50]:
print(a1[14:17:2])
print(a1[-7:-4:2])

[14 16]
[14 16]

In [47]:
a1[11:18:3]

array([11, 14, 17])

In [51]:
a1[-10:-3:3]

array([11, 14, 17])

In [52]:
### Print all the elements of a1 in the reverse order

In [55]:
reverse = a1[::-1]
print(reverse)

[20 19 18 17 16 15 14 13 12 11 10  9  8  7  6  5  4  3  2  1  0]

In [53]:
### create an array with elements 1,2,3,4 and slice out 2,4 using the step method.

In [57]:
a2 = np.array([1,2,3,4])
print(a2[1::2])

[2 4]

In [54]:
### slice out 3,4 from the above array using negetive slicing.

In [59]:
print(a1[-2:])

[3 4]

In [60]:
print(a1[-2::1])

[3 4]

#### As a data scientist,your task is to create a python object that explores numpy's attributes and functions.Use the dataset containing daily temperature records for a week
* temperatures=[76.2,78.2,74.5,79.3,82.6,79.8,66.5,71.6]
* 1) Explore the key attributes-ndim,shape,size
* 2) demonstrate numpy array functions like reshape,flatten,transpose.

In [54]:
temperatures=[76.2,78.2,74.5,79.3,82.6,79.8,66.5,71.6]
temp = np.array(temperatures)
#1
dimension = temp.ndim 
shape = temp.shape
size = temp.size
print(f"dimension = {dimension}\nshape = {shape}\nsize = {size}")
#2
two_d = temp.reshape(2,4)
three_d = temp.reshape(2,2,2)
flat = three_d.flatten()
trans = np.transpose(two_d)
print(f"Reshaping to create 2D array \n {two_d}\nReshaping to create 3D array \n{three_d}\n\nUsing flatten to create 1D array = {flat}\nTranspose\n{trans}")

dimension = 1
shape = (8,)
size = 8
Reshaping to create 2D array
 [[76.2 78.2 74.5 79.3]
 [82.6 79.8 66.5 71.6]]
Reshaping to create 3D array
[[[76.2 78.2]
  [74.5 79.3]]

 [[82.6 79.8]
  [66.5 71.6]]]

Using flatten to create 1D array = [76.2 78.2 74.5 79.3 82.6 79.8 66.5 71.6]
Transpose
[[76.2 82.6]
 [78.2 79.8]
 [74.5 66.5]
 [79.3 71.6]]

###### Q)Create a 3D array using elements from 5-16,convert it to a 2D array and finally to a 1D array using the flatten method

In [53]:
array_3d=np.arange(5,17).reshape(2,3,2)

#convert it to a 2D array:

array_2d=array_3d.reshape(6,2)

#convert it to a 1D array:

array_1d=array_2d.flatten()


print(array_3d)
print(array_2d)
print(array_1d)

[[[ 5  6]
  [ 7  8]
  [ 9 10]]

 [[11 12]
  [13 14]
  [15 16]]]
[[ 5  6]
 [ 7  8]
 [ 9 10]
 [11 12]
 [13 14]
 [15 16]]
[ 5  6  7  8  9 10 11 12 13 14 15 16]

#### Q)Check if the values 15,20,25 are present in the above array you have created.

#### Q) array_test=np.array(1,1,1,2,4,8,9,2,4,1,6) is a 1D array.Find out the number of elements present in the array and the most frequently occuring element.

#####  bincount function from numpy returns the count of values in each bin starting from 0 to the highest value in the collection.

###### Q) array_1d=np.array([1,2,3,4,5,6]) and create a 3D array with elements 1-18.
* print out the value 15 from the 3D array
* slice out 7,6,11 from the 3D array
* slice out the second row from the first 2D array

##### Q) create an array with the first 30 natural numbers. slice out 12,14,16,18,20,22 using the step method (take a step of 2,and use negetive indices only)

##### Q) print all the elements in the above subset in the reverse order

##### Q) create a numpy array with elements 5-20 and update the values of all elements from the fifth position onwards to 25

##### Q)  modify every second element in the above array and assign a value 16 to it.

#### pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,built on top of the Python programming language.it offers data structures and operations for manipulating numerical data. The two data structures are 1) A 1 dimentional Series 2) A Dataframe

#### Pandas Series() is a function used to generate a series. Creation of a series from a numpy array requires the array() function from the Numpy package.

### Intrinsic data alignment happens with the pandas package. Each data structure has got the internal indexes aligned to each element.

In [1]:
import pandas as pd
import numpy as np

In [2]:
#### series support multiple data types.

In [3]:
ser1=pd.Series([45,89.5,None,True,(5,6),'text'])
ser1

0        45
1      89.5
2      None
3      True
4    (5, 6)
5      text
dtype: object

In [6]:
ser2=pd.Series([45,89.5,None,True,(5,6),'text'],index=['a','b','c','d','e','f'])
ser2

a        45
b      89.5
c      None
d      True
e    (5, 6)
f      text
dtype: object

In [7]:
arr=np.array([34,67,89,12,45.6])
ser3=pd.Series(arr)
ser3

0    34.0
1    67.0
2    89.0
3    12.0
4    45.6
dtype: float64

In [8]:
t1=(34,67,89,12,45.6)
ser4=pd.Series(t1)
ser4

0    34.0
1    67.0
2    89.0
3    12.0
4    45.6
dtype: float64

In [10]:
ser4[3]

12.0

In [13]:
dict1={'a':'apple','b':2426,10875:'employee','language':'python'}
ser5=pd.Series(dict1)
ser5

a              apple
b               2426
10875       employee
language      python
dtype: object

In [11]:
ser5[10875]

'employee'

In [15]:
print(type(ser5))

<class 'pandas.core.series.Series'>

In [14]:
data={'Age':[24,28,31,35,42],
     'Name':['Sim','Tim','Jack','Lisa','Lily'],
      'Marks':[82,85,65,76,91]}

df=pd.DataFrame(data)
print(df)
print(type(df))

   Age  Name  Marks
0   24   Sim     82
1   28   Tim     85
2   31  Jack     65
3   35  Lisa     76
4   42  Lily     91
<class 'pandas.core.frame.DataFrame'>

In [16]:
###Loc function helps us slice dataframes using the row/column labels

In [18]:
df.loc[3,'Name']

'Lisa'

In [19]:
###last 3 rows
df.loc[2:4,:]

   Age  Name  Marks
2   31  Jack     65
3   35  Lisa     76
4   42  Lily     91

In [27]:
#last 3 rows using iloc function:
df.iloc[2:,:]

   Age  Name  Marks
2   31  Jack     65
3   35  Lisa     76
4   42  Lily     91

In [20]:
###i want the info of jack,lisa and lily but i want only their names and marks.
df.loc[2:,['Name','Marks']]

   Name  Marks
2  Jack     65
3  Lisa     76
4  Lily     91

In [21]:
df.loc[2:,'Name':]

   Name  Marks
2  Jack     65
3  Lisa     76
4  Lily     91

In [25]:
### say i want a single column from this dataframe.say-age
df.loc[:,['Age']]

   Age
0   24
1   28
2   31
3   35
4   42

In [29]:
df.iloc[:,[0]]

   Age
0   24
1   28
2   31
3   35
4   42

In [30]:
df.Age

0    24
1    28
2    31
3    35
4    42
Name: Age, dtype: int64

In [31]:
### see all columns in our dataframe
df.columns

Index(['Age', 'Name', 'Marks'], dtype='object')

In [33]:
###slice out the name and age of tim,lisa,lily using loc and iloc

In [34]:
df.iloc[[1, 3, 4], [1, 0]]

   Name  Age
1   Tim   28
3  Lisa   35
4  Lily   42

In [36]:
df.loc[(1,3,4),'Age':'Name']

   Age  Name
1   28   Tim
3   35  Lisa
4   42  Lily

### Functions of a dataframe:

* tail,head-selectively displays the bottom and top 5 rows of a dataframe.
* sample() functions helps select random rows and columns from a dataframe.
* info() function gives more info on the dataset
* describe() functions gives the summary stats for the variables in the data
* query() functions helps us to query the dataset on some condition
* loc() helps us to query the dataset based on column and row labels
* iloc() helps us to query the dataset based on the index position of rows and columns
* unique() helps us get the distinct values in a certain row or column
* null() helps us to locate missing values
* fillna() helps us to fill missing values in the dataset with some value
* rename() helps us to rename the column name
* where() replaces cells with null values where the where condition is not satisfied
* drop() used  to drop columns/rows from a dataset
* corr() used to find relationships between variables.

In [37]:
data=pd.read_csv('Salary_Data.csv')
print('data is loaded')

data is loaded

In [38]:
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [39]:
###head function will display the top 5 rows of the dataframe:
data.head(7)

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0
5              2.9  56642.0
6              3.0  60150.0

In [40]:
#tail function prints the default 5 rows from the bottom:
data.tail()

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [41]:
import pandas as pd

In [42]:
###sample:
data.sample(10)

    YearsExperience    Salary
22              7.9  101302.0
3               2.0   43525.0
23              8.2  113812.0
17              5.3   83088.0
15              4.9   67938.0
6               3.0   60150.0
24              8.7  109431.0
5               2.9   56642.0
4               2.2   39891.0
25              9.0  105582.0

In [43]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 612.0 bytes

In [44]:
### describe-:
data.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [45]:
#query:
data.query('YearsExperience>5.5')

    YearsExperience    Salary
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [46]:
##### use the loc function to display the salary of the last two employees using the loc and iloc functions.

In [51]:
print(data.loc[28:,['Salary']])
print(data.iloc[[28,29],[1]])

      Salary
28  122391.0
29  121872.0
      Salary
28  122391.0
29  121872.0

In [47]:
###### filter out all those employees with salary greater than 50k and experience less than 3 years using loc function.

In [49]:
data.loc[(data["YearsExperience"] < 3) &(data["Salary"] > 50000),["Salary","YearsExperience"]]

    Salary  YearsExperience
5  56642.0              2.9

In [19]:
import numpy as np
import pandas as pd

##############
#settings for display:
pd.set_option('display.max_columns',None)
pd.set_option('display.max_rows',None)

In [20]:
iris=pd.read_csv('Iris.csv')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [9]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [10]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [12]:
iris.isna().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [13]:
#### by default every function is applied accross rows,but if we want to apply a function across columns we need to specify
### that by giving axis=1 (columns),axis=0(rows)

In [14]:
data3={'Name':['A','B','C','F','G','K','J'],
       'Age':[20,21,22,23,24,np.nan,28],
       'Marks':[80,85,82,86,91,np.nan,np.nan]}
df1=pd.DataFrame(data3)
df1

  Name   Age  Marks
0    A  20.0   80.0
1    B  21.0   85.0
2    C  22.0   82.0
3    F  23.0   86.0
4    G  24.0   91.0
5    K   NaN    NaN
6    J  28.0    NaN

In [15]:
##if we want to drop the rows with missing values:
#df1.dropna()

In [16]:
df1['Age']=df1['Age'].fillna(df1['Age'].mean())

In [17]:
df1

  Name   Age  Marks
0    A  20.0   80.0
1    B  21.0   85.0
2    C  22.0   82.0
3    F  23.0   86.0
4    G  24.0   91.0
5    K  23.0    NaN
6    J  28.0    NaN

In [18]:
df1['Marks'] = df1['Marks']. fillna(df1['Marks'].median())
df1

  Name   Age  Marks
0    A  20.0   80.0
1    B  21.0   85.0
2    C  22.0   82.0
3    F  23.0   86.0
4    G  24.0   91.0
5    K  23.0   85.0
6    J  28.0   85.0

In [19]:
data3={'Name':['A','B','C','F','G','K','J'],
       'Age':[20,21,22,23,24,np.nan,28],
       'Marks':[80,85,82,86,91,np.nan,np.nan]}
df2=pd.DataFrame(data3)
df2

  Name   Age  Marks
0    A  20.0   80.0
1    B  21.0   85.0
2    C  22.0   82.0
3    F  23.0   86.0
4    G  24.0   91.0
5    K   NaN    NaN
6    J  28.0    NaN

In [25]:
df2.dropna(inplace=True) #inplace=True makes the changes in the original dataset parmanent.

In [26]:
df2

  Name   Age  Marks
0    A  20.0   80.0
1    B  21.0   85.0
2    C  22.0   82.0
3    F  23.0   86.0
4    G  24.0   91.0

In [27]:
###writing the output to the local env:
df2.to_csv('saved_output.csv')

In [28]:
####Q) create a dataset with 3 columns and 8 rows with missing values,and use the fillna function to impute every
#### record with the value 16

In [14]:
data = {
    'Column1': [1, 2, np.nan, 4, 5, np.nan, 7, 8],
    'Column2': [np.nan, 12, 13, np.nan, 15, 16, np.nan, 18],
    'Column3': [21, 22, 23, 24, np.nan, np.nan, 27, 28]
}

df = pd.DataFrame(data)
print(df)
df_filled = df.fillna(16)
print(df_filled)

   Column1  Column2  Column3
0      1.0      NaN     21.0
1      2.0     12.0     22.0
2      NaN     13.0     23.0
3      4.0      NaN     24.0
4      5.0     15.0      NaN
5      NaN     16.0      NaN
6      7.0      NaN     27.0
7      8.0     18.0     28.0
   Column1  Column2  Column3
0      1.0     16.0     21.0
1      2.0     12.0     22.0
2     16.0     13.0     23.0
3      4.0     16.0     24.0
4      5.0     15.0     16.0
5     16.0     16.0     16.0
6      7.0     16.0     27.0
7      8.0     18.0     28.0

In [29]:
#### Q) Rename the columns in the above dataset to 'var1','var2' and 'var3'

In [15]:
df_renamed = df_filled.rename(columns={'Column1': 'var1', 'Column2': 'var2', 'Column3': 'var3'})
print(df_renamed)

   var1  var2  var3
0   1.0  16.0  21.0
1   2.0  12.0  22.0
2  16.0  13.0  23.0
3   4.0  16.0  24.0
4   5.0  15.0  16.0
5  16.0  16.0  16.0
6   7.0  16.0  27.0
7   8.0  18.0  28.0

In [30]:
####Q)create a column 'city' and give it values 'mumbai','kolkata','bangalore','Noida','gurgaon','Goa' 'hyderabad'

In [17]:
cities = ['Mumbai', 'Kolkata', 'Bangalore', 'Noida', 'Gurgaon', 'Goa', 'Hyderabad', 'Chennai']
df['city'] = cities
df

   Column1  Column2  Column3       city
0      1.0      NaN     21.0     Mumbai
1      2.0     12.0     22.0    Kolkata
2      NaN     13.0     23.0  Bangalore
3      4.0      NaN     24.0      Noida
4      5.0     15.0      NaN    Gurgaon
5      NaN     16.0      NaN        Goa
6      7.0      NaN     27.0  Hyderabad
7      8.0     18.0     28.0    Chennai

In [31]:
####Q)drop the variables petal length and sepal width from the dataframe iris

In [22]:
iris = iris.drop(['petal_length', 'sepal_width'], axis=1)
print(iris)

     sepal_length  petal_width     species
0             5.1          0.2      setosa
1             4.9          0.2      setosa
2             4.7          0.2      setosa
3             4.6          0.2      setosa
4             5.0          0.2      setosa
5             5.4          0.4      setosa
6             4.6          0.3      setosa
7             5.0          0.2      setosa
8             4.4          0.2      setosa
9             4.9          0.1      setosa
10            5.4          0.2      setosa
11            4.8          0.2      setosa
12            4.8          0.1      setosa
13            4.3          0.1      setosa
14            5.8          0.2      setosa
15            5.7          0.4      setosa
16            5.4          0.4      setosa
17            5.1          0.3      setosa
18            5.7          0.3      setosa
19            5.1          0.3      setosa
20            5.4          0.2      setosa
21            5.1          0.4      setosa
22            4.6          0.2      setosa
23            5.1          0.5      setosa
24            4.8          0.2      setosa
25            5.0          0.2      setosa
26            5.0          0.4      setosa
27            5.2          0.2      setosa
28            5.2          0.2      setosa
29            4.7          0.2      setosa
30            4.8          0.2      setosa
31            5.4          0.4      setosa
32            5.2          0.1      setosa
33            5.5          0.2      setosa
34            4.9          0.1      setosa
35            5.0          0.2      setosa
36            5.5          0.2      setosa
37            4.9          0.1      setosa
38            4.4          0.2      setosa
39            5.1          0.2      setosa
40            5.0          0.3      setosa
41            4.5          0.3      setosa
42            4.4          0.2      setosa
43            5.0          0.6      setosa
44            5.1          0.4      setosa
45            4.8          0.3      setosa
46            5.1          0.2      setosa
47            4.6          0.2      setosa
48            5.3          0.2      setosa
49            5.0          0.2      setosa
50            7.0          1.4  versicolor
51            6.4          1.5  versicolor
52            6.9          1.5  versicolor
53            5.5          1.3  versicolor
54            6.5          1.5  versicolor
55            5.7          1.3  versicolor
56            6.3          1.6  versicolor
57            4.9          1.0  versicolor
58            6.6          1.3  versicolor
59            5.2          1.4  versicolor
60            5.0          1.0  versicolor
61            5.9          1.5  versicolor
62            6.0          1.0  versicolor
63            6.1          1.4  versicolor
64            5.6          1.3  versicolor
65            6.7          1.4  versicolor
66            5.6          1.5  versicolor
67            5.8          1.0  versicolor
68            6.2          1.5  versicolor
69            5.6          1.1  versicolor
70            5.9          1.8  versicolor
71            6.1          1.3  versicolor
72            6.3          1.5  versicolor
73            6.1          1.2  versicolor
74            6.4          1.3  versicolor
75            6.6          1.4  versicolor
76            6.8          1.4  versicolor
77            6.7          1.7  versicolor
78            6.0          1.5  versicolor
79            5.7          1.0  versicolor
80            5.5          1.1  versicolor
81            5.5          1.0  versicolor
82            5.8          1.2  versicolor
83            6.0          1.6  versicolor
84            5.4          1.5  versicolor
85            6.0          1.6  versicolor
86            6.7          1.5  versicolor
87            6.3          1.3  versicolor
88            5.6          1.3  versicolor
89            5.5          1.3  versicolor
90            5.5          1.2  versicolor
91            6.1          1.4  versicolor
92            5.8          1.2  versicolor
93            5.0          1.0  versicolor
94            5.6          1.3  versicolor
95            5.7          1.2  versicolor
96            5.7          1.3  versicolor
97            6.2          1.3  versicolor
98            5.1          1.1  versicolor
99            5.7          1.3  versicolor
100           6.3          2.5   virginica
101           5.8          1.9   virginica
102           7.1          2.1   virginica
103           6.3          1.8   virginica
104           6.5          2.2   virginica
105           7.6          2.1   virginica
106           4.9          1.7   virginica
107           7.3          1.8   virginica
108           6.7          1.8   virginica
109           7.2          2.5   virginica
110           6.5          2.0   virginica
111           6.4          1.9   virginica
112           6.8          2.1   virginica
113           5.7          2.0   virginica
114           5.8          2.4   virginica
115           6.4          2.3   virginica
116           6.5          1.8   virginica
117           7.7          2.2   virginica
118           7.7          2.3   virginica
119           6.0          1.5   virginica
120           6.9          2.3   virginica
121           5.6          2.0   virginica
122           7.7          2.0   virginica
123           6.3          1.8   virginica
124           6.7          2.1   virginica
125           7.2          1.8   virginica
126           6.2          1.8   virginica
127           6.1          1.8   virginica
128           6.4          2.1   virginica
129           7.2          1.6   virginica
130           7.4          1.9   virginica
131           7.9          2.0   virginica
132           6.4          2.2   virginica
133           6.3          1.5   virginica
134           6.1          1.4   virginica
135           7.7          2.3   virginica
136           6.3          2.4   virginica
137           6.4          1.8   virginica
138           6.0          1.8   virginica
139           6.9          2.1   virginica
140           6.7          2.4   virginica
141           6.9          2.3   virginica
142           5.8          1.9   virginica
143           6.8          2.3   virginica
144           6.7          2.5   virginica
145           6.7          2.3   virginica
146           6.3          1.9   virginica
147           6.5          2.0   virginica
148           6.2          2.3   virginica
149           5.9          1.8   virginica

In [32]:
####Q)drop the second last row of the dataset iris

In [23]:
iris = iris.drop(iris.index[-2])
iris = iris.reset_index(drop=True)
print(iris)

     sepal_length  petal_width     species
0             5.1          0.2      setosa
1             4.9          0.2      setosa
2             4.7          0.2      setosa
3             4.6          0.2      setosa
4             5.0          0.2      setosa
5             5.4          0.4      setosa
6             4.6          0.3      setosa
7             5.0          0.2      setosa
8             4.4          0.2      setosa
9             4.9          0.1      setosa
10            5.4          0.2      setosa
11            4.8          0.2      setosa
12            4.8          0.1      setosa
13            4.3          0.1      setosa
14            5.8          0.2      setosa
15            5.7          0.4      setosa
16            5.4          0.4      setosa
17            5.1          0.3      setosa
18            5.7          0.3      setosa
19            5.1          0.3      setosa
20            5.4          0.2      setosa
21            5.1          0.4      setosa
22            4.6          0.2      setosa
23            5.1          0.5      setosa
24            4.8          0.2      setosa
25            5.0          0.2      setosa
26            5.0          0.4      setosa
27            5.2          0.2      setosa
28            5.2          0.2      setosa
29            4.7          0.2      setosa
30            4.8          0.2      setosa
31            5.4          0.4      setosa
32            5.2          0.1      setosa
33            5.5          0.2      setosa
34            4.9          0.1      setosa
35            5.0          0.2      setosa
36            5.5          0.2      setosa
37            4.9          0.1      setosa
38            4.4          0.2      setosa
39            5.1          0.2      setosa
40            5.0          0.3      setosa
41            4.5          0.3      setosa
42            4.4          0.2      setosa
43            5.0          0.6      setosa
44            5.1          0.4      setosa
45            4.8          0.3      setosa
46            5.1          0.2      setosa
47            4.6          0.2      setosa
48            5.3          0.2      setosa
49            5.0          0.2      setosa
50            7.0          1.4  versicolor
51            6.4          1.5  versicolor
52            6.9          1.5  versicolor
53            5.5          1.3  versicolor
54            6.5          1.5  versicolor
55            5.7          1.3  versicolor
56            6.3          1.6  versicolor
57            4.9          1.0  versicolor
58            6.6          1.3  versicolor
59            5.2          1.4  versicolor
60            5.0          1.0  versicolor
61            5.9          1.5  versicolor
62            6.0          1.0  versicolor
63            6.1          1.4  versicolor
64            5.6          1.3  versicolor
65            6.7          1.4  versicolor
66            5.6          1.5  versicolor
67            5.8          1.0  versicolor
68            6.2          1.5  versicolor
69            5.6          1.1  versicolor
70            5.9          1.8  versicolor
71            6.1          1.3  versicolor
72            6.3          1.5  versicolor
73            6.1          1.2  versicolor
74            6.4          1.3  versicolor
75            6.6          1.4  versicolor
76            6.8          1.4  versicolor
77            6.7          1.7  versicolor
78            6.0          1.5  versicolor
79            5.7          1.0  versicolor
80            5.5          1.1  versicolor
81            5.5          1.0  versicolor
82            5.8          1.2  versicolor
83            6.0          1.6  versicolor
84            5.4          1.5  versicolor
85            6.0          1.6  versicolor
86            6.7          1.5  versicolor
87            6.3          1.3  versicolor
88            5.6          1.3  versicolor
89            5.5          1.3  versicolor
90            5.5          1.2  versicolor
91            6.1          1.4  versicolor
92            5.8          1.2  versicolor
93            5.0          1.0  versicolor
94            5.6          1.3  versicolor
95            5.7          1.2  versicolor
96            5.7          1.3  versicolor
97            6.2          1.3  versicolor
98            5.1          1.1  versicolor
99            5.7          1.3  versicolor
100           6.3          2.5   virginica
101           5.8          1.9   virginica
102           7.1          2.1   virginica
103           6.3          1.8   virginica
104           6.5          2.2   virginica
105           7.6          2.1   virginica
106           4.9          1.7   virginica
107           7.3          1.8   virginica
108           6.7          1.8   virginica
109           7.2          2.5   virginica
110           6.5          2.0   virginica
111           6.4          1.9   virginica
112           6.8          2.1   virginica
113           5.7          2.0   virginica
114           5.8          2.4   virginica
115           6.4          2.3   virginica
116           6.5          1.8   virginica
117           7.7          2.2   virginica
118           7.7          2.3   virginica
119           6.0          1.5   virginica
120           6.9          2.3   virginica
121           5.6          2.0   virginica
122           7.7          2.0   virginica
123           6.3          1.8   virginica
124           6.7          2.1   virginica
125           7.2          1.8   virginica
126           6.2          1.8   virginica
127           6.1          1.8   virginica
128           6.4          2.1   virginica
129           7.2          1.6   virginica
130           7.4          1.9   virginica
131           7.9          2.0   virginica
132           6.4          2.2   virginica
133           6.3          1.5   virginica
134           6.1          1.4   virginica
135           7.7          2.3   virginica
136           6.3          2.4   virginica
137           6.4          1.8   virginica
138           6.0          1.8   virginica
139           6.9          2.1   virginica
140           6.7          2.4   virginica
141           6.9          2.3   virginica
142           5.8          1.9   virginica
143           6.8          2.3   virginica
144           6.7          2.5   virginica
145           6.7          2.3   virginica
146           6.3          1.9   virginica
147           6.5          2.0   virginica
148           5.9          1.8   virginica

In [33]:
####Q)filter out the variables with float datatype

In [24]:
float_columns = iris.select_dtypes(include=['float64'])
print(float_columns)

     sepal_length  petal_width
0             5.1          0.2
1             4.9          0.2
2             4.7          0.2
3             4.6          0.2
4             5.0          0.2
5             5.4          0.4
6             4.6          0.3
7             5.0          0.2
8             4.4          0.2
9             4.9          0.1
10            5.4          0.2
11            4.8          0.2
12            4.8          0.1
13            4.3          0.1
14            5.8          0.2
15            5.7          0.4
16            5.4          0.4
17            5.1          0.3
18            5.7          0.3
19            5.1          0.3
20            5.4          0.2
21            5.1          0.4
22            4.6          0.2
23            5.1          0.5
24            4.8          0.2
25            5.0          0.2
26            5.0          0.4
27            5.2          0.2
28            5.2          0.2
29            4.7          0.2
30            4.8          0.2
31            5.4          0.4
32            5.2          0.1
33            5.5          0.2
34            4.9          0.1
35            5.0          0.2
36            5.5          0.2
37            4.9          0.1
38            4.4          0.2
39            5.1          0.2
40            5.0          0.3
41            4.5          0.3
42            4.4          0.2
43            5.0          0.6
44            5.1          0.4
45            4.8          0.3
46            5.1          0.2
47            4.6          0.2
48            5.3          0.2
49            5.0          0.2
50            7.0          1.4
51            6.4          1.5
52            6.9          1.5
53            5.5          1.3
54            6.5          1.5
55            5.7          1.3
56            6.3          1.6
57            4.9          1.0
58            6.6          1.3
59            5.2          1.4
60            5.0          1.0
61            5.9          1.5
62            6.0          1.0
63            6.1          1.4
64            5.6          1.3
65            6.7          1.4
66            5.6          1.5
67            5.8          1.0
68            6.2          1.5
69            5.6          1.1
70            5.9          1.8
71            6.1          1.3
72            6.3          1.5
73            6.1          1.2
74            6.4          1.3
75            6.6          1.4
76            6.8          1.4
77            6.7          1.7
78            6.0          1.5
79            5.7          1.0
80            5.5          1.1
81            5.5          1.0
82            5.8          1.2
83            6.0          1.6
84            5.4          1.5
85            6.0          1.6
86            6.7          1.5
87            6.3          1.3
88            5.6          1.3
89            5.5          1.3
90            5.5          1.2
91            6.1          1.4
92            5.8          1.2
93            5.0          1.0
94            5.6          1.3
95            5.7          1.2
96            5.7          1.3
97            6.2          1.3
98            5.1          1.1
99            5.7          1.3
100           6.3          2.5
101           5.8          1.9
102           7.1          2.1
103           6.3          1.8
104           6.5          2.2
105           7.6          2.1
106           4.9          1.7
107           7.3          1.8
108           6.7          1.8
109           7.2          2.5
110           6.5          2.0
111           6.4          1.9
112           6.8          2.1
113           5.7          2.0
114           5.8          2.4
115           6.4          2.3
116           6.5          1.8
117           7.7          2.2
118           7.7          2.3
119           6.0          1.5
120           6.9          2.3
121           5.6          2.0
122           7.7          2.0
123           6.3          1.8
124           6.7          2.1
125           7.2          1.8
126           6.2          1.8
127           6.1          1.8
128           6.4          2.1
129           7.2          1.6
130           7.4          1.9
131           7.9          2.0
132           6.4          2.2
133           6.3          1.5
134           6.1          1.4
135           7.7          2.3
136           6.3          2.4
137           6.4          1.8
138           6.0          1.8
139           6.9          2.1
140           6.7          2.4
141           6.9          2.3
142           5.8          1.9
143           6.8          2.3
144           6.7          2.5
145           6.7          2.3
146           6.3          1.9
147           6.5          2.0
148           5.9          1.8

In [34]:
####Q)encode the species variable of the iris dataset

In [25]:
df_one_hot = pd.get_dummies(iris, columns=['species'], prefix='species')
print(df_one_hot)

     sepal_length  petal_width  species_setosa  species_versicolor  \
0             5.1          0.2               1                   0
1             4.9          0.2               1                   0
2             4.7          0.2               1                   0
3             4.6          0.2               1                   0
4             5.0          0.2               1                   0
5             5.4          0.4               1                   0
6             4.6          0.3               1                   0
7             5.0          0.2               1                   0
8             4.4          0.2               1                   0
9             4.9          0.1               1                   0
10            5.4          0.2               1                   0
11            4.8          0.2               1                   0
12            4.8          0.1               1                   0
13            4.3          0.1               1                   0
14            5.8          0.2               1                   0
15            5.7          0.4               1                   0
16            5.4          0.4               1                   0
17            5.1          0.3               1                   0
18            5.7          0.3               1                   0
19            5.1          0.3               1                   0
20            5.4          0.2               1                   0
21            5.1          0.4               1                   0
22            4.6          0.2               1                   0
23            5.1          0.5               1                   0
24            4.8          0.2               1                   0
25            5.0          0.2               1                   0
26            5.0          0.4               1                   0
27            5.2          0.2               1                   0
28            5.2          0.2               1                   0
29            4.7          0.2               1                   0
30            4.8          0.2               1                   0
31            5.4          0.4               1                   0
32            5.2          0.1               1                   0
33            5.5          0.2               1                   0
34            4.9          0.1               1                   0
35            5.0          0.2               1                   0
36            5.5          0.2               1                   0
37            4.9          0.1               1                   0
38            4.4          0.2               1                   0
39            5.1          0.2               1                   0
40            5.0          0.3               1                   0
41            4.5          0.3               1                   0
42            4.4          0.2               1                   0
43            5.0          0.6               1                   0
44            5.1          0.4               1                   0
45            4.8          0.3               1                   0
46            5.1          0.2               1                   0
47            4.6          0.2               1                   0
48            5.3          0.2               1                   0
49            5.0          0.2               1                   0
50            7.0          1.4               0                   1
51            6.4          1.5               0                   1
52            6.9          1.5               0                   1
53            5.5          1.3               0                   1
54            6.5          1.5               0                   1
55            5.7          1.3               0                   1
56            6.3          1.6               0                   1
57            4.9          1.0               0                   1
58            6.6          1.3               0                   1
59            5.2          1.4               0                   1
60            5.0          1.0               0                   1
61            5.9          1.5               0                   1
62            6.0          1.0               0                   1
63            6.1          1.4               0                   1
64            5.6          1.3               0                   1
65            6.7          1.4               0                   1
66            5.6          1.5               0                   1
67            5.8          1.0               0                   1
68            6.2          1.5               0                   1
69            5.6          1.1               0                   1
70            5.9          1.8               0                   1
71            6.1          1.3               0                   1
72            6.3          1.5               0                   1
73            6.1          1.2               0                   1
74            6.4          1.3               0                   1
75            6.6          1.4               0                   1
76            6.8          1.4               0                   1
77            6.7          1.7               0                   1
78            6.0          1.5               0                   1
79            5.7          1.0               0                   1
80            5.5          1.1               0                   1
81            5.5          1.0               0                   1
82            5.8          1.2               0                   1
83            6.0          1.6               0                   1
84            5.4          1.5               0                   1
85            6.0          1.6               0                   1
86            6.7          1.5               0                   1
87            6.3          1.3               0                   1
88            5.6          1.3               0                   1
89            5.5          1.3               0                   1
90            5.5          1.2               0                   1
91            6.1          1.4               0                   1
92            5.8          1.2               0                   1
93            5.0          1.0               0                   1
94            5.6          1.3               0                   1
95            5.7          1.2               0                   1
96            5.7          1.3               0                   1
97            6.2          1.3               0                   1
98            5.1          1.1               0                   1
99            5.7          1.3               0                   1
100           6.3          2.5               0                   0
101           5.8          1.9               0                   0
102           7.1          2.1               0                   0
103           6.3          1.8               0                   0
104           6.5          2.2               0                   0
105           7.6          2.1               0                   0
106           4.9          1.7               0                   0
107           7.3          1.8               0                   0
108           6.7          1.8               0                   0
109           7.2          2.5               0                   0
110           6.5          2.0               0                   0
111           6.4          1.9               0                   0
112           6.8          2.1               0                   0
113           5.7          2.0               0                   0
114           5.8          2.4               0                   0
115           6.4          2.3               0                   0
116           6.5          1.8               0                   0
117           7.7          2.2               0                   0
118           7.7          2.3               0                   0
119           6.0          1.5               0                   0
120           6.9          2.3               0                   0
121           5.6          2.0               0                   0
122           7.7          2.0               0                   0
123           6.3          1.8               0                   0
124           6.7          2.1               0                   0
125           7.2          1.8               0                   0
126           6.2          1.8               0                   0
127           6.1          1.8               0                   0
128           6.4          2.1               0                   0
129           7.2          1.6               0                   0
130           7.4          1.9               0                   0
131           7.9          2.0               0                   0
132           6.4          2.2               0                   0
133           6.3          1.5               0                   0
134           6.1          1.4               0                   0
135           7.7          2.3               0                   0
136           6.3          2.4               0                   0
137           6.4          1.8               0                   0
138           6.0          1.8               0                   0
139           6.9          2.1               0                   0
140           6.7          2.4               0                   0
141           6.9          2.3               0                   0
142           5.8          1.9               0                   0
143           6.8          2.3               0                   0
144           6.7          2.5               0                   0
145           6.7          2.3               0                   0
146           6.3          1.9               0                   0
147           6.5          2.0               0                   0
148           5.9          1.8               0                   0

     species_virginica
0                    0
1                    0
2                    0
3                    0
4                    0
5                    0
6                    0
7                    0
8                    0
9                    0
10                   0
11                   0
12                   0
13                   0
14                   0
15                   0
16                   0
17                   0
18                   0
19                   0
20                   0
21                   0
22                   0
23                   0
24                   0
25                   0
26                   0
27                   0
28                   0
29                   0
30                   0
31                   0
32                   0
33                   0
34                   0
35                   0
36                   0
37                   0
38                   0
39                   0
40                   0
41                   0
42                   0
43                   0
44                   0
45                   0
46                   0
47                   0
48                   0
49                   0
50                   0
51                   0
52                   0
53                   0
54                   0
55                   0
56                   0
57                   0
58                   0
59                   0
60                   0
61                   0
62                   0
63                   0
64                   0
65                   0
66                   0
67                   0
68                   0
69                   0
70                   0
71                   0
72                   0
73                   0
74                   0
75                   0
76                   0
77                   0
78                   0
79                   0
80                   0
81                   0
82                   0
83                   0
84                   0
85                   0
86                   0
87                   0
88                   0
89                   0
90                   0
91                   0
92                   0
93                   0
94                   0
95                   0
96                   0
97                   0
98                   0
99                   0
100                  1
101                  1
102                  1
103                  1
104                  1
105                  1
106                  1
107                  1
108                  1
109                  1
110                  1
111                  1
112                  1
113                  1
114                  1
115                  1
116                  1
117                  1
118                  1
119                  1
120                  1
121                  1
122                  1
123                  1
124                  1
125                  1
126                  1
127                  1
128                  1
129                  1
130                  1
131                  1
132                  1
133                  1
134                  1
135                  1
136                  1
137                  1
138                  1
139                  1
140                  1
141                  1
142                  1
143                  1
144                  1
145                  1
146                  1
147                  1
148                  1

In [35]:
####Q)Find all the planta which belong to the species 'virginica' and 'versicolor'

In [26]:
filtered_species = iris[iris['species'].isin(['virginica', 'versicolor'])]
print(filtered_species)

     sepal_length  petal_width     species
50            7.0          1.4  versicolor
51            6.4          1.5  versicolor
52            6.9          1.5  versicolor
53            5.5          1.3  versicolor
54            6.5          1.5  versicolor
55            5.7          1.3  versicolor
56            6.3          1.6  versicolor
57            4.9          1.0  versicolor
58            6.6          1.3  versicolor
59            5.2          1.4  versicolor
60            5.0          1.0  versicolor
61            5.9          1.5  versicolor
62            6.0          1.0  versicolor
63            6.1          1.4  versicolor
64            5.6          1.3  versicolor
65            6.7          1.4  versicolor
66            5.6          1.5  versicolor
67            5.8          1.0  versicolor
68            6.2          1.5  versicolor
69            5.6          1.1  versicolor
70            5.9          1.8  versicolor
71            6.1          1.3  versicolor
72            6.3          1.5  versicolor
73            6.1          1.2  versicolor
74            6.4          1.3  versicolor
75            6.6          1.4  versicolor
76            6.8          1.4  versicolor
77            6.7          1.7  versicolor
78            6.0          1.5  versicolor
79            5.7          1.0  versicolor
80            5.5          1.1  versicolor
81            5.5          1.0  versicolor
82            5.8          1.2  versicolor
83            6.0          1.6  versicolor
84            5.4          1.5  versicolor
85            6.0          1.6  versicolor
86            6.7          1.5  versicolor
87            6.3          1.3  versicolor
88            5.6          1.3  versicolor
89            5.5          1.3  versicolor
90            5.5          1.2  versicolor
91            6.1          1.4  versicolor
92            5.8          1.2  versicolor
93            5.0          1.0  versicolor
94            5.6          1.3  versicolor
95            5.7          1.2  versicolor
96            5.7          1.3  versicolor
97            6.2          1.3  versicolor
98            5.1          1.1  versicolor
99            5.7          1.3  versicolor
100           6.3          2.5   virginica
101           5.8          1.9   virginica
102           7.1          2.1   virginica
103           6.3          1.8   virginica
104           6.5          2.2   virginica
105           7.6          2.1   virginica
106           4.9          1.7   virginica
107           7.3          1.8   virginica
108           6.7          1.8   virginica
109           7.2          2.5   virginica
110           6.5          2.0   virginica
111           6.4          1.9   virginica
112           6.8          2.1   virginica
113           5.7          2.0   virginica
114           5.8          2.4   virginica
115           6.4          2.3   virginica
116           6.5          1.8   virginica
117           7.7          2.2   virginica
118           7.7          2.3   virginica
119           6.0          1.5   virginica
120           6.9          2.3   virginica
121           5.6          2.0   virginica
122           7.7          2.0   virginica
123           6.3          1.8   virginica
124           6.7          2.1   virginica
125           7.2          1.8   virginica
126           6.2          1.8   virginica
127           6.1          1.8   virginica
128           6.4          2.1   virginica
129           7.2          1.6   virginica
130           7.4          1.9   virginica
131           7.9          2.0   virginica
132           6.4          2.2   virginica
133           6.3          1.5   virginica
134           6.1          1.4   virginica
135           7.7          2.3   virginica
136           6.3          2.4   virginica
137           6.4          1.8   virginica
138           6.0          1.8   virginica
139           6.9          2.1   virginica
140           6.7          2.4   virginica
141           6.9          2.3   virginica
142           5.8          1.9   virginica
143           6.8          2.3   virginica
144           6.7          2.5   virginica
145           6.7          2.3   virginica
146           6.3          1.9   virginica
147           6.5          2.0   virginica
148           5.9          1.8   virginica

In [36]:
#####Q)find the duplicate entries and clean the dataset

In [27]:
duplicates = iris[iris.duplicated()]
print("Duplicate Entries:")
print(duplicates)

df_cleaned = iris.drop_duplicates()
print("Cleaned Dataset:")
print(df_cleaned)

Duplicate Entries:
     sepal_length  petal_width     species
7             5.0          0.2      setosa
16            5.4          0.4      setosa
19            5.1          0.3      setosa
20            5.4          0.2      setosa
22            4.6          0.2      setosa
24            4.8          0.2      setosa
25            5.0          0.2      setosa
28            5.2          0.2      setosa
29            4.7          0.2      setosa
30            4.8          0.2      setosa
31            5.4          0.4      setosa
34            4.9          0.1      setosa
35            5.0          0.2      setosa
36            5.5          0.2      setosa
37            4.9          0.1      setosa
38            4.4          0.2      setosa
39            5.1          0.2      setosa
42            4.4          0.2      setosa
44            5.1          0.4      setosa
46            5.1          0.2      setosa
47            4.6          0.2      setosa
49            5.0          0.2      setosa
85            6.0          1.6  versicolor
88            5.6          1.3  versicolor
89            5.5          1.3  versicolor
91            6.1          1.4  versicolor
92            5.8          1.2  versicolor
93            5.0          1.0  versicolor
94            5.6          1.3  versicolor
96            5.7          1.3  versicolor
99            5.7          1.3  versicolor
123           6.3          1.8   virginica
135           7.7          2.3   virginica
141           6.9          2.3   virginica
142           5.8          1.9   virginica
147           6.5          2.0   virginica
Cleaned Dataset:
     sepal_length  petal_width     species
0             5.1          0.2      setosa
1             4.9          0.2      setosa
2             4.7          0.2      setosa
3             4.6          0.2      setosa
4             5.0          0.2      setosa
5             5.4          0.4      setosa
6             4.6          0.3      setosa
8             4.4          0.2      setosa
9             4.9          0.1      setosa
10            5.4          0.2      setosa
11            4.8          0.2      setosa
12            4.8          0.1      setosa
13            4.3          0.1      setosa
14            5.8          0.2      setosa
15            5.7          0.4      setosa
17            5.1          0.3      setosa
18            5.7          0.3      setosa
21            5.1          0.4      setosa
23            5.1          0.5      setosa
26            5.0          0.4      setosa
27            5.2          0.2      setosa
32            5.2          0.1      setosa
33            5.5          0.2      setosa
40            5.0          0.3      setosa
41            4.5          0.3      setosa
43            5.0          0.6      setosa
45            4.8          0.3      setosa
48            5.3          0.2      setosa
50            7.0          1.4  versicolor
51            6.4          1.5  versicolor
52            6.9          1.5  versicolor
53            5.5          1.3  versicolor
54            6.5          1.5  versicolor
55            5.7          1.3  versicolor
56            6.3          1.6  versicolor
57            4.9          1.0  versicolor
58            6.6          1.3  versicolor
59            5.2          1.4  versicolor
60            5.0          1.0  versicolor
61            5.9          1.5  versicolor
62            6.0          1.0  versicolor
63            6.1          1.4  versicolor
64            5.6          1.3  versicolor
65            6.7          1.4  versicolor
66            5.6          1.5  versicolor
67            5.8          1.0  versicolor
68            6.2          1.5  versicolor
69            5.6          1.1  versicolor
70            5.9          1.8  versicolor
71            6.1          1.3  versicolor
72            6.3          1.5  versicolor
73            6.1          1.2  versicolor
74            6.4          1.3  versicolor
75            6.6          1.4  versicolor
76            6.8          1.4  versicolor
77            6.7          1.7  versicolor
78            6.0          1.5  versicolor
79            5.7          1.0  versicolor
80            5.5          1.1  versicolor
81            5.5          1.0  versicolor
82            5.8          1.2  versicolor
83            6.0          1.6  versicolor
84            5.4          1.5  versicolor
86            6.7          1.5  versicolor
87            6.3          1.3  versicolor
90            5.5          1.2  versicolor
95            5.7          1.2  versicolor
97            6.2          1.3  versicolor
98            5.1          1.1  versicolor
100           6.3          2.5   virginica
101           5.8          1.9   virginica
102           7.1          2.1   virginica
103           6.3          1.8   virginica
104           6.5          2.2   virginica
105           7.6          2.1   virginica
106           4.9          1.7   virginica
107           7.3          1.8   virginica
108           6.7          1.8   virginica
109           7.2          2.5   virginica
110           6.5          2.0   virginica
111           6.4          1.9   virginica
112           6.8          2.1   virginica
113           5.7          2.0   virginica
114           5.8          2.4   virginica
115           6.4          2.3   virginica
116           6.5          1.8   virginica
117           7.7          2.2   virginica
118           7.7          2.3   virginica
119           6.0          1.5   virginica
120           6.9          2.3   virginica
121           5.6          2.0   virginica
122           7.7          2.0   virginica
124           6.7          2.1   virginica
125           7.2          1.8   virginica
126           6.2          1.8   virginica
127           6.1          1.8   virginica
128           6.4          2.1   virginica
129           7.2          1.6   virginica
130           7.4          1.9   virginica
131           7.9          2.0   virginica
132           6.4          2.2   virginica
133           6.3          1.5   virginica
134           6.1          1.4   virginica
136           6.3          2.4   virginica
137           6.4          1.8   virginica
138           6.0          1.8   virginica
139           6.9          2.1   virginica
140           6.7          2.4   virginica
143           6.8          2.3   virginica
144           6.7          2.5   virginica
145           6.7          2.3   virginica
146           6.3          1.9   virginica
148           5.9          1.8   virginica

In [37]:
#### Filter employees having salary greater than 15k and experience greater than 4 years using the 'where' clause.

In [29]:
import pandas as pd
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'salary': [12000, 16000, 18000, 20000, 15000],
    'experience': [3, 5, 6, 2, 4]
}
df_employees = pd.DataFrame(data)

filtered_employees = df_employees.where((df_employees['salary'] > 15000) & (df_employees['experience'] > 4))

filtered_employees = filtered_employees.dropna()
print(filtered_employees)

      name   salary  experience
1      Bob  16000.0         5.0
2  Charlie  18000.0         6.0

In [39]:
##### In dataframe df2 if age is greater than 21 update the name as P and marks as 88

In [30]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [22, 19, 25, 20],
    'marks': [85, 90, 75, 88]
}

df2 = pd.DataFrame(data)
# Update 'name' and 'marks' where 'age' > 21
df2.loc[df2['age'] > 21, ['name', 'marks']] = ['P', 88]
# Output the result
print(df2)

    name  age  marks
0      P   22     88
1    Bob   19     90
2      P   25     88
3  David   20     88